In [1]:
from pymongo import MongoClient
import pandas as pd
import sqlite3 as sq
import numpy as np

password = 'dbPassword'
URI = f'mongodb://dbUser:dbPassword@146.56.143.16:27017'

client = MongoClient(URI)

print(client)

DATABASE = 'myFirstDatabase'

db = client[DATABASE]

coll = db['movies']

MongoClient(host=['146.56.143.16:27017'], document_class=dict, tz_aware=False, connect=True)

In [2]:
conn = sq.connect('test.db')

In [3]:
cur = conn.cursor()

In [4]:
tmp = coll.find()

In [218]:
movies = coll.find({}, {'_id': 0, 'name': 1, 'code': 1, 'runtime': 1, 'date': 1, 'grades': 1})
movie_list = []
for i in movies :
    tmp = {
        'id': i['code'],
        'name': i['name'],
        'runtime': i['runtime'],
        'release': i['date'],
        'grade_korea': None,
        'grade_foreign': None
    }
    for j in i['grades'] :
        if int(j['code']) > 1011000 :
            tmp['grade_foreign'] = j['name']
        else :
            tmp['grade_korea'] = j['name']
    movie_list.append(tmp)
movie_df = pd.DataFrame(movie_list)
movie_df.drop_duplicates(subset='id', inplace=True)

In [223]:
movie_df.head()

,id,name,runtime,release,grade_korea,grade_foreign
0,33680,엑스페리먼트 (The Experiment),109분,20020322,청소년 관람불가,None
1,32199,엔조이 유어 썸머 (Enjoy Your Summer),22분,20020913,15세 관람가,None
2,39496,여고 동창생,,20021209,None,None
3,38120,여우와 솜사탕,,20020000,None,None
4,34362,연애소설 (Lover's Concerto),106분,20020913,12세 관람가,None

In [224]:
# movie_df.loc[movie_df['runtime'] == '', 'runtime'] = '-'
movie_df = movie_df.replace('', np.nan)
movie_df['runtime'] = movie_df['runtime'].apply(lambda x: x.replace('분','') if x is not np.nan else x)

In [225]:
movie_df

,id,name,runtime,release,grade_korea,grade_foreign
0,33680,엑스페리먼트 (The Experiment),109,20020322,청소년 관람불가,None
1,32199,엔조이 유어 썸머 (Enjoy Your Summer),22,20020913,15세 관람가,None
2,39496,여고 동창생,NaN,20021209,None,None
3,38120,여우와 솜사탕,NaN,20020000,None,None
4,34362,연애소설 (Lover's Concerto),106,20020913,12세 관람가,None
...,...,...,...,...,...,...
19537,50689,위험한 댄싱걸,99,20081002,None,None
19538,67448,"유, 더 리빙 (You, The Living)",93,20080619,None,None
19539,51052,유리의 성,NaN,20080906,None,None
19540,52071,은하철도 999 리턴즈 - 에피소드 1 신비소녀 쥬라 (Galaxy Express ...,32,20081224,None,None
19541,90571,음악여행 라라라,NaN,20081126,None,None

In [8]:
comments = coll.find({}, {'code':1, 'comments': 1})

In [9]:
comment_list = []
for i in comments :
    for j in i['comments'] :
        j['moviecode'] = i['code']
        comment_list.append(j)

In [10]:
comment_df = pd.DataFrame(comment_list)
# comment_df.drop_duplicates(subset='code', inplace=True)

In [5]:
comment_list = None

In [11]:
comment_df.shape

(7712099, 8)

In [14]:
comment_df.drop_duplicates(inplace=True)

In [12]:
tmp = comment_df[comment_df.duplicated(subset='code', keep=False)].sort_values('code')['usercode']

In [13]:
comment_df.drop(tmp[tmp.isnull()].index, inplace=True)

In [15]:
comment_df.shape

(7606880, 8)

In [192]:
user_df = comment_df.copy()
user_df = user_df[['usercode', 'username']] 
user_df.drop_duplicates(subset='usercode',inplace=True)
print(user_df.shape)
user_df.head()

  usercode        username
0   723005  까페모카(jush****)
1  6136993  ㅁㄴㅇㄹ(mapl****)
2  7777694  우히헤헤(alsg****)
3  8326476   손형v(rhah****)
4  1077113        sang****

In [3]:
nations = coll.find({}, {'code': 1, 'nations': 1})
nation_list = []
for i in nations :
    for j in i['nations'] :
        j['moviecode'] = i['code']
        nation_list.append(j)
nation_df = pd.DataFrame(nation_list)
print(nation_df.shape)
nation_df.drop_duplicates(inplace=True)
nation_df.head()

(21821, 3)

  code name moviecode
0   DE   독일     33680
1   KR   한국     32199
2   KR   한국     39496
3   KR   한국     38120
4   KR   한국     34362

In [80]:
actors = coll.find({}, {'code': 1, 'actors': 1})
actor_list = []
for i in actors :
    for j in i['actors'] :
        j['moviecode'] = i['code']
        actor_list.append(j)
actor_df = pd.DataFrame(actor_list)
print(actor_df.shape)
actor_df.drop_duplicates(inplace=True)
actor_df.head()

(154725, 4)

     code         name role moviecode
0    1128  모리츠 블라이브트로이   주연     33680
1  220088       마렌 에거트   주연     33680
2   60209      크리스찬 버켈   주연     33680
3  111064   유스투스 본 도난이   주연     33680
4   58617   올리버 스토코브스키   주연     33680

In [81]:
actor_df.dtypes

code         object
name         object
role         object
moviecode    object
dtype: object

In [82]:
actor_df.rename(columns={'code': 'actor_id', 'moviecode': 'movie_id'}, inplace=True)

In [83]:
actor_df.actor_id = actor_df.actor_id.astype(int)
actor_df.movie_id = actor_df.movie_id.astype(int)

In [86]:
actor_df['role'].replace('주연', 1, inplace=True)
actor_df['role'].replace('조연', 0, inplace=True)
actor_df.head()

   actor_id         name  role  movie_id
0      1128  모리츠 블라이브트로이     1     33680
1    220088       마렌 에거트     1     33680
2     60209      크리스찬 버켈     1     33680
3    111064   유스투스 본 도난이     1     33680
4     58617   올리버 스토코브스키     1     33680

In [114]:
directors = coll.find({}, {'code': 1, 'directors': 1})
director_list = []
for i in directors :
    for j in i['directors'] :
        j['moviecode'] = i['code']
        director_list.append(j)
director_df = pd.DataFrame(director_list)
print(director_df.shape)
director_df.drop_duplicates(inplace=True)
director_df.head()

(22351, 3)

    code      name moviecode
0   4144  올리버 히르비겔     33680
1  66758       이형곤     32199
2  48917       노동렬     39496
3  64598       하태진     39496
4  37197        정인     38120

In [116]:
# director_df.rename(columns={'code': 'director_id', 'moviecode': 'movie_id'}, inplace=True)
director_df.director_id = director_df.director_id.astype(int)
director_df.movie_id = director_df.movie_id.astype(int)
director_df.index.name = 'id'

In [123]:
genres = coll.find({}, {'code': 1, 'genres': 1})
genre_list = []
for i in genres :
    for j in i['genres'] :
        j['moviecode'] = i['code']
        genre_list.append(j)
genre_df = pd.DataFrame(genre_list)
print(genre_df.shape)
genre_df.drop_duplicates(inplace=True)
genre_df.head()

(25882, 3)

  code    name moviecode
0    7     스릴러     33680
1    1     드라마     33680
2    1     드라마     39496
3    1     드라마     38120
4    5  멜로/로맨스     34362

In [145]:
tmp = genre_df.drop_duplicates(subset='genre_id').sort_values('genre_id').set_index('genre_id')
tmp.index.name = 'id'
tmp.drop(columns='movie_id')

      name
id
1      드라마
2      판타지
3       서부
4       공포
5   멜로/로맨스
6       모험
7      스릴러
8      느와르
9       컬트
10   다큐멘터리
11     코미디
12      가족
13    미스터리
14      전쟁
15   애니메이션
16      범죄
17     뮤지컬
18      SF
19      액션
20      무협
21      에로
22    서스펜스
23      서사
24   블랙코미디
25      실험
29    공연실황

In [129]:
genre_df.rename(columns={'code': 'genre_id', 'moviecode': 'movie_id'}, inplace=True)
genre_df.genre_id = genre_df.genre_id.astype(int)
genre_df.movie_id = genre_df.movie_id.astype(int)
genre_df.index.name = 'id'

In [165]:
import pymysql
if conn : conn.close()
conn = pymysql.connect(host='localhost', user='root', password='2108', db='first', charset='utf8')
cur = conn.cursor()

In [147]:
cur.execute('''
CREATE TABLE genres (
    id INT NOT NULL PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(32)
)
''')
conn.commit()

In [131]:
cur.execute('''
CREATE TABLE movie_genre (
    id INT NOT NULL PRIMARY KEY AUTO_INCREMENT,
    genre_id INT,
    name VARCHAR(128),
    movie_id INT,
    foreign key(movie_id) references movies(id)
    on delete cascade
    on update cascade
) CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci
''')
conn.commit()

In [118]:
cur.execute('''
CREATE TABLE movie_director (
    id INT NOT NULL PRIMARY KEY AUTO_INCREMENT,
    director_id INT,
    name VARCHAR(128),
    movie_id INT,
    foreign key(movie_id) references movies(id)
    on delete cascade
    on update cascade
) CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci
''')
conn.commit()

In [103]:
cur.execute('''
CREATE TABLE movie_actor (
    id INT NOT NULL PRIMARY KEY AUTO_INCREMENT,
    actor_id INT,
    name VARCHAR(128),
    role INT,
    movie_id INT,
    foreign key(movie_id) references movies(id)
    on delete cascade
    on update cascade
) CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci
''')
conn.commit()

In [73]:
cur.execute('''
CREATE TABLE movie_nation (
    id INT NOT NULL PRIMARY KEY AUTO_INCREMENT,
    nation_id VARCHAR(32),
    nation VARCHAR(128),
    movie_id INT,
    foreign key(movie_id) references movies(id)
    on delete cascade
    on update cascade
) CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci
''')

0

In [32]:
cur.execute('''
CREATE TABLE comments (
    id INT NOT NULL PRIMARY KEY,
    score INT,
    text TEXT,
    created_at DATETIME,
    userid INT,
    username VARCHAR(128),
    viewer INT,
    movieid INT,
    foreign key(movieid) references movies(id)
    on delete cascade
    on update cascade
) CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci
''')

0

In [148]:
from sqlalchemy import create_engine
conn.close()
engine = create_engine('mysql+pymysql://root:'+'2108'+'@localhost:3306/first?charset=utf8mb4', encoding='utf-8')
conn = engine.connect()

In [150]:
tmp.drop(columns='movie_id').to_sql('genres', conn, if_exists='append', index=True, index_label='id')

26

In [170]:
txt = '2'
cur.execute(f"SELECT id FROM users WHERE id='{txt}'")
result = cur.fetchall()
print(len(result))

0